     A*%%TS  SD  20260128  223311  MEYKER      REL-V7R4M0  5770-WDS
     A*  92/12/17  11:02:18                REL-R03M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A*N23                                  SFLNXTCHG
     A          R SG000001                  SFL
     A*%%TS  SD  20260128  223311  MEYKER      REL-V7R4M0  5770-WDS
     A*N23                                  SFLNXTCHG
     A            OPC            1Y 0B 11  5EDTCDE(Z)
     A                                      DSPATR(PC)
     A                                      CHECK(AB)
     A                                      DSPATR(UL)
     A                                      VALUES(1)
     A                                      CHECK(ER)
     A            CIACVE    R        O 11 11REFFLD(SEGCIAF/CIACVE *LIBL/SEGCIA)
     A            CIANOM    R        O 11 16REFFLD(SEGCIAF/CIANOM *LIBL/SEGCIA)
     A            CIALIB    R        H      REFFLD(SEGCIAF/CIALIB *LIBL/SEGCIA)
     A            CIAMIN    R        H      REFFLD(SEGCIAF/CIAMIN *LIBL/SEGCIA0-
     A                                      1)
     A            CIAMFI    R        H      REFFLD(SEGCIAF/CIAMFI *LIBL/SEGCIA0-
     A                                      1)
     A          R SG000002                  SFLCTL(SG000001)
     A*%%TS  SD  20260128  212543  MEYKER      REL-V7R4M0  5770-WDS
     A                                      CF03(03 'Salir')
     A                                      CF12(12 'Anterior')
     A                                      CF05(05 'Renueva')
     A                                      CF11(11 'Vista 2')
     A                                      CF07(07 'Inicio')
     A                                      CF08(08 'Final')
     A                                      OVERLAY
     A N51                                  ERASE(SG000001)
     A                                      SFLCSRRRN(&LINE)
     A  51                                  SFLDSP
     A  50                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  22                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0011)
     A            LINE           5S 0H
     A            LIN            4S 0H      SFLRCDNBR(CURSOR)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2  2'Seguridad'
     A                                  2 70TIME
     A                                  6  4'Teclee opciones, pulse Intro'
     A                                      COLOR(BLU)
     A                                  7  8'1=Seleccionar'
     A                                      COLOR(BLU)
     A                                 10  4'Opc'
     A                                      DSPATR(HI)
     A                                  3  2'SG0000'
     A                                 10  9'Código'
     A                                      DSPATR(HI)
     A                                 10 17'Nombre de la Compañia'
     A                                      DSPATR(HI)
     A                                  1 52USER
     A                                  3 30'Selección de Compañias'
     A                                      DSPATR(HI)
     A                                  1  2'Control de aplicaciones'
     A            WSID          10A  O  3 70
     A          R SG000003
     A*%%TS  SD  19970714  152517  JTIBURCIO   REL-V3R7M0  5716-PW1
     A                                      CF03(03 'Salir')
     A                                      CF12(12 'Anterior')
     A                                      CF05(05 'Renueva')
     A                                      CF14(14 'Listar ordenes')
     A                                      OVERLAY
     A            MDT           78A  O 23  2COLOR(BLU)
     A          R MSGSFL                    SFL
     A*%%TS  SD  19970623  123943  JTIBURCIO   REL-V3R7M0  5716-PW1
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            @MSGQ                     SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGSFL)
     A*%%TS  SD  19970825  090414  LMIRANDA    REL-V3R7M0  5716-PW1
     A                                      HELP
     A                                      OVERLAY
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A  80                                  SFLINZ
     A  80                                  SFLEND
     A                                      SFLSIZ(0005)
     A                                      SFLPAG(0001)
     A            @MSGQ                     SFLPGMQ(10)
