     A*%%TS  SD  20260415  151733  MEYKER      REL-V7R4M0  5770-WDS
     A*  92/12/17  11:02:18                REL-R03M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R SGLIC0101
     A*%%TS  SD  20260130  080246  MEYKER      REL-V7R4M0  5770-WDS
     A                                      CF03(03 'Salir')
     A                                      CF12(12 'Anterior')
     A                                      CF24(24 'Aplicar')
     A                                      CF04(04 'Lista')
     A                                      RTNCSRLOC(&RECORD &CAMPO)
     A                                      SLNO(01)
     A                                      CLRL(23)
     A                                      OVERLAY
     A                                      PRINT
     A            CAMPO         10A  H
     A            RECORD        10A  H
     A            COLUM          3S 0H
     A            FILA           3S 0H
     A                                  1  2'Miranda Valdez, S. R. L.'
     A                                      DSPATR(HI)
     A                                  1 52USER
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2  2'Seguridad'
     A                                  2 70TIME
     A            MSGPGM        10A  O  3  2
     A            TITULO        45A  O  3 18DSPATR(HI)
     A            WSID          10A  O  3 70
     A                                  6  7'Digite y presione intro.'
     A                                      COLOR(BLU)
     A                                  8  2'Nombre de la Empresa . .'
     A            NOMCIA        40A  B  8 27
     A  30                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                  9  2'Identificacion Empresa .'
     A            IDEEMP        15A  B  9 27
     A  31                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A                                 10  2'Nro. Serie del Equipo. .'
     A            NSERIAL       10A  B 10 27
     A  32                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A                                 11  2'Modelo del Equipo. . . .'
     A            NMODEL         8A  B 11 27
     A  33                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A                                 12  2'Tipo de Procesador . . .'
     A            PROCTYPE       8A  B 12 27
     A  34                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A                                 13  2'Nombre del Host. . . . .'
     A            HOSTNAME       8A  B 13 27
     A  35                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A                                 14  2'Fecha Inicio Vigencia. .'
     A            FECINI         8Y 0B 14 27
     A  36                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A                                 14 41'ddmmyyyy'
     A                                 15  2'Fecha Finaliza Vigencia.'
     A            FECFIN         8Y 0B 15 27
     A  37                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A                                 16  2'Numero Maximo Usuarios .'
     A            MAXUSR         5Y 0B 16 27
     A  38                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                 23  6'F3=Salir'
     A                                      COLOR(BLU)
     A                                 23 62'F12=Anterior'
     A                                      COLOR(BLU)
     A          R MSGSFL                    SFL
     A*%%TS  SD  19970623  123943  JTIBURCIO   REL-V3R7M0  5716-PW1
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            @MSGQ                     SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGSFL)
     A*%%TS  SD  19970623  144713  JTIBURCIO   REL-V3R7M0  5716-PW1
     A                                      HELP
     A                                      OVERLAY
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A  80                                  SFLINZ
     A  80                                  SFLEND
     A                                      SFLSIZ(0005)
     A                                      SFLPAG(0001)
     A            @MSGQ                     SFLPGMQ(10)
