     h   Copyright ('Miranda Valdez, S. A., 1997')
     h   Debug Option(*SRCSTMT:*NODEBUGIO)
      *
     d/Copy *Libl/Fuentes,sg9003
      *
     d/Copy *Libl/Fuentes,sg9001
      *
      **General Information
      *
     *-----------------------------------------------------------------*
      **General Information
    /Include FUENTES,SG9001       // Data Structure of PGM
    /Copy Fuentes,SG9001          // Data Structure of PGM
      //* --------------------+-----------------+
                                                  //Message Display
                                                  //* Help
              //Timestamp
      //         sdfsdafsdafsdfsd
      //----
    *  xxx                        // Data Structure of PGM
