     h   copyright ('Miranda Valdez, S. A., 1999')
      *  ================================================================*
      *  IDENTIFICACION:                                                 *
      *  ---------------                                                 *
      *  NOMBRE DEL PROGRAMA ..........: SG0028                          *
      *  AUTOR ........................: JOSE ANTONIO TIBURCIO GOMEZ     *
      *  FECHA ESCRITURA ..............: 18 / 03 / 94                    *
      *  DESCR:                                                          *
      *    Programa comun de calculo tiempo transcurrido entre fechas    *
      *                                                                  *
      *  ================================================================*
      * --------------------------------------------------------
      *                  Bloque principal                      -
      * --------------------------------------------------------
     d MsgCod          S            100
      *
     c                   Eval      MsgCod = %Trim('Prueba SG8097')
      *
     c                   call      'SG8097'
     c                   parm                    MsgCod          100
      *
     c                   eval      *inlr = *on
