     h   Copyright ('Miranda Valdez, S. A., 1997')
     h   Debug Option(*SRCSTMT:*NODEBUGIO)
      **General Information
      *
     *-----------------------------------------------------------------*
      **General Information
    /Include FUENTES,SG9001       // Data Structure of PGM
    /Copy Fuentes,SG9001          // Data Structure of PGM
      //* --------------------+-----------------+
        //Módulo Comprobante Fiscal
                                                  //Message Display
                                                  //* Help
              //Timestamp
      //         sdfsdafsdafsdfsd
      //----
    *  xxx                        // Data Structure of PGM
