 /*=================================================================*/
 /*   NOMBRE DEL PROGRAMA .......: ES3003J3                         */
 /*   APLICACION.................: Estadisticas de Ventas           */
 /*   AUTOR .....................: Luis J. Miranda V.               */
 /*   FECHA ESCRITURA ...........: 28 / 05 / 2009                   */
 /*                                                                 */
 /* Crea Archivo por Vendedor clientes y productos entre fechas     */
 /*=================================================================*/
 INI:        PGM        PARM(&CODCLI &CODVEN &FECDES &FECHAS &CODDIS +
                          &CODCAT &CODSUP)
             COPYRIGHT  TEXT('Miranda Valdez, S. A., 1997')

             DCL        VAR(&FECDES) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FECHAS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&CODDIS) TYPE(*CHAR) LEN(3)
             DCL        VAR(&CODSUP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CODCAT) TYPE(*CHAR) LEN(4)
             DCL        VAR(&CODVEN) TYPE(*CHAR) LEN(3)
             DCL        VAR(&CODCLI) TYPE(*CHAR) LEN(7)
             DCL        VAR(&NCIA)  TYPE(*CHAR) LEN(11)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MAIL) TYPE(*CHAR) LEN(50)
             DCL        VAR(&NOMCIA) TYPE(*CHAR) LEN(40)

             DCL        VAR(&MESANO) TYPE(*CHAR) LEN(6)
             DCL        VAR(&Arc01) TYPE(*CHAR) LEN(25)
             DCL        VAR(&ArcExl) TYPE(*CHAR) LEN(50)

             RTVDTAARA  DTAARA(*LDA (360 40)) RTNVAR(&NOMCIA)
             RTVDTAARA  DTAARA(*LDA (450 10)) RTNVAR(&PRT)
             RTVDTAARA  DTAARA(*LDA (412 11)) RTNVAR(&NCIA)
             RTVDTAARA  DTAARA(*LDA (601 50)) RTNVAR(&Mail)

             CHGVAR     VAR(&MESANO) VALUE(%SST(&FECHAS 3 6))
             CHGVAR     VAR(&ARC01) VALUE('/qdls/conver/' *CAT &NCIA)
             CHGVAR     VAR(&ARCEXL) VALUE(&ARC01 *CAT '/E3' *CAT +
                          &MESANO *CAT '.xls')

 /* Archivo Temporal */
             RMVLIBLE   LIB(QTEMP)
             MONMSG     MSGID(CPF9999)

             ADDLIBLE   LIB(QTEMP)
             MONMSG     MSGID(CPF2103)

             CRTDUPOBJ  OBJ(ESTTVCP) FROMLIB(&NCIA) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ESTTVCP) DATA(*NO) /* +
                          Crear archivo temporal */
             MONMSG     MSGID(CPF9999)

             CHGPF      FILE(QTEMP/ESTTVCP) SIZE(*NOMAX)
             MONMSG     MSGID(CPF9999)

             CLRPFM     FILE(QTEMP/ESTTVCP)

             OVRDBF     FILE(ESTTVCP) TOFILE(QTEMP/ESTTVCP) SHARE(*YES)

             CALL       PGM(*LIBL/ES3003) PARM((&CODDIS) (&CODSUP) +
                          (&CODVEN) (&CODCLI) (&CODCAT) (&FECDES) +
                          (&FECHAS))
             DLTOVR     FILE(*ALL)


/*           CPYTOEXCEL FROMFILE(QTEMP/ESTTVCP) TOOBJ(&ARCEXL) +
                          COLHDG(*COLHDG)                         */

             SNDFEXCEL  SNDF((QTEMP/ESTTVCP +
                          Est_vendedor_cliente.XLSx *FIRST *ALL +
                          ESTTVCP *NONE)) TO((&MAIL)) SUBJECT('PGM +
                          ES3003 -- Archivo en Excel ESTTVCP') +
                          COLHDG(*ALIASBLD) TRANSFORM(*OOXML) +
                          MSG(('Anexo Archivo Estadisticas por +
                          Vendedor, clientes y productos De' *BCAT +
                          (&NOMCIA)))

             DLTF       FILE(QTEMP/ESTTVCP)
             MONMSG     MSGID(CPF9999)


 END:        ENDPGM
