 /*=================================================================*/
 /*   NOMBRE DEL PROGRAMA .......: ES3003J1                         */
 /*   APLICACION.................: Estadisticas de Ventas           */
 /*   AUTOR .....................: Luis J. Miranda V.               */
 /*   FECHA ESCRITURA ...........: 28 / 05 / 2009                   */
 /*                                                                 */
 /* Crea Archivo por Vendedor clientes y productos entre fechas     */
 /*=================================================================*/
 INI:        PGM
             COPYRIGHT  TEXT('Miranda Valdez, S. A., 1997')

             DCL        VAR(&CIA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&NCIA) TYPE(*CHAR) LEN(11)
             DCL        VAR(&CTL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&INI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&NOMCIA) TYPE(*CHAR) LEN(40)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('ES3003')
             DCL        VAR(&RESP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&NCIA)  TYPE(*CHAR) LEN(11)
             DCL        VAR(&TITULO) TYPE(*CHAR) LEN(50)
             DCL        VAR(&PROGRA) TYPE(*CHAR) LEN(10) +
                          VALUE(ES3003J2)

             RTVDTAARA  DTAARA(*LDA (401 2)) RTNVAR(&CIA)
             RTVJOBA    JOB(&WSID) USER(&USER)

             CHGDTAARA  DTAARA(*LDA (551 10)) VALUE(&WSID)
             CHGDTAARA  DTAARA(*LDA (561 10)) VALUE(&USER)
             CHGVAR     VAR(&TITULO) VALUE('Ventas por vendedor, +
                          clientes y productos')

             CALL       PGM(SEGLIB/SEGLIBL)

             IF         COND(&CIA *EQ ' ') THEN(CALL +
                          PGM(*LIBL/SG0000J1))

             RTVDTAARA  DTAARA(*LDA (400 1)) RTNVAR(&CTL)
             RTVDTAARA  DTAARA(*LDA (401 2)) RTNVAR(&CIA)
             IF         COND(&CTL *EQ ' ') THEN(RETURN)

             RTVDTAARA  DTAARA(*LDA (403 2)) RTNVAR(&INI)
             RTVDTAARA  DTAARA(*LDA (412 11)) RTNVAR(&NCIA)

             CALL       PGM(SEGLIB/SG2050J1) PARM(&PGM &RESP)

             IF         COND(&RESP *NE ' ') THEN(DO)
             SNDPGMMSG  MSGID(SEG0000) MSGF(SEGLIB/SEGMSGF)
             GOTO       CMDLBL(END)
             ENDDO

            ADDLIBLE &NCIA
             MONMSG     MSGID(CPF2103)

             CALL       PGM(*LIBL/FA3133) PARM(&TITULO &PROGRA)
             SNDPGMMSG  MSGID(SEG8888) MSGF(SEGLIB/SEGMSGF)

 END:        ENDPGM
