 /*=================================================================*/
 /*   NOMBRE DEL PROGRAMA .......: FA3204J2                         */
 /*   APLICACION.................: Sistema de Facturacion           */
 /*   AUTOR .....................: Luis J. Miranda V.               */
 /*   FECHA ESCRITURA ...........: 02 / 07 / 2026                   */
 /*                                                                 */
 /*            Proceso Crear Archivo Temporal KPI Churn             */
 /*=================================================================*/
 INI:        PGM        PARM(&CODSUP &CODVEN &FECHAS)
             COPYRIGHT  TEXT('Miranda Valdez, S. A., 1997')

             DCL        VAR(&CODSUP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CODVEN) TYPE(*CHAR) LEN(3)
             DCL        VAR(&FECHAS)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&FECH) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CIA)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&NCIA) TYPE(*CHAR) LEN(11)
             DCL        VAR(&NomCia) TYPE(*CHAR) LEN(40)
             DCL        VAR(&MAIL) TYPE(*CHAR) LEN(50)
             DCL        VAR(&EnvMai) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)

             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CIA)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('FA3204')
             DCL        VAR(&EJECUTA) TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(*LDA (360 40)) RTNVAR(&NOMCIA)
             RTVDTAARA  DTAARA(*LDA (412 11)) RTNVAR(&NCIA)
             RTVDTAARA  DTAARA(*LDA (401 2)) RTNVAR(&CIA)
             RTVDTAARA  DTAARA(*LDA (450 10)) RTNVAR(&PRT)
             RTVDTAARA  DTAARA(*LDA (500 1)) RTNVAR(&EnvMai)
             RTVDTAARA  DTAARA(*LDA (601 50)) RTNVAR(&Mail)
             RTVJOBA    JOB(&WSID) USER(&USER)

             CVTDAT     DATE(&FECHAS) TOVAR(&FECH) FROMFMT(*YYMD) +
                          TOFMT(*DMYY) TOSEP(*SYSVAL)

             CALL       PGM(*LIBL/FA3204) PARM(&CODSUP &CODVEN +
                           &FECHAS)
/* Copia a Excel                                                    */

             IF         COND(&ENVMAI *EQ "S") THEN(DO)

             SNDFEXCEL  SNDF((*LIBL/FAC3204RC +
                          Ranking_Churn_Clasificacion.XLSx *FIRST +
                          *ALL Ranking_KPI_Churn_Clasificacion +
                          *NONE)) TO((&MAIL)) SUBJECT('PGM FA3204 +
                          Ranking KPI Clasificacion a una Fecha') +
                          COLHDG(*ALIASBLD) TRANSFORM(*OOXML) +
                          MSG(('Anexo Archivo de Ranking de KPI +
                          Churn por Supervisor, Vendedor y +
                          Clasificacion al' *BCAT (&FECH) *BCAT 'de +
                          la Compania' *BCAT (&NOMCIA))) +
                          COLHDGFMT(*CENTERSEL)

             SNDFEXCEL  SNDF((*LIBL/FAC3204RS +
                          Ranking_Churn_Supervisor.XLSx *FIRST *ALL +
                          Ranking_KPI_Churn_Supervisor *NONE)) +
                          TO((&MAIL)) SUBJECT('PGM FA3204 Ranking +
                          KPI Supervisor a una Fecha') +
                          COLHDG(*ALIASBLD) TRANSFORM(*OOXML) +
                          MSG(('Anexo Archivo de Ranking de KPI +
                          Churn por Supervisor al' *BCAT (&FECH) +
                          *BCAT 'de la Compania' *BCAT (&NOMCIA))) +
                          COLHDGFMT(*CENTERSEL)

             SNDFEXCEL  SNDF((*LIBL/FAC3204RV +
                          Ranking_Churn_Vendedor.XLSx *FIRST *ALL +
                          Ranking_KPI_Churn_Vendedor *NONE)) +
                          TO((&MAIL)) SUBJECT('PGM FA3204 Ranking +
                          KPI Vendedor a una Fecha') +
                          COLHDG(*ALIASBLD) TRANSFORM(*OOXML) +
                          MSG(('Anexo Archivo de Ranking de KPI +
                          Churn por Vendedor al' *BCAT (&FECH) +
                          *BCAT 'de la Compania' *BCAT (&NOMCIA))) +
                          COLHDGFMT(*CENTERSEL)

             SNDFEXCEL  SNDF((*LIBL/FAC3204 +
                          KPI_Churn_Por_Clientes.XLSx *FIRST *ALL +
                          KPI_Churn_Por_Clientes *NONE)) +
                          TO((&MAIL)) SUBJECT('PGM FA3204 Archivo +
                          en Excel Churn Clientes  a una Fecha') +
                          COLHDG(*ALIASBLD) TRANSFORM(*OOXML) +
                          MSG(('Anexo Archivo de KPI Churn por +
                          Clientes al' *BCAT (&FECH) *BCAT 'de la +
                          Compania' *BCAT (&NOMCIA))) +
                          COLHDGFMT(*CENTERSEL)
             ENDDO

/* Actualiza control ejecucion Proceso */
             CALL       PGM(*LIBL/SG8099) PARM(&CIA &PGM)

 END:        ENDPGM
