      *----------------------------------------------------
      *                BLOQUE PRINCIPAL                   -
      *----------------------------------------------------
     c                   Eval      CodSup = '00'
     c                   Eval      CodVen = '000'
     c                   Eval      FecPro = '20260131'
      *
     c                   Call      'FA3205'
     c                   PARM                    CodSup            2
     c                   PARM                    CodVen            3
     c                   PARM                    FecPro            8
      *
     c                   seton                                        lr
