      *----------------------------------------------------
      *                BLOQUE PRINCIPAL                   -
      *----------------------------------------------------
     c                   Eval      FecPro = '20260131'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   Eval      FecPro = '20260228'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   Eval      FecPro = '20260331'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   Eval      FecPro = '20260430'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   Eval      FecPro = '20260531'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   Eval      FecPro = '20260630'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   Eval      FecPro = '20260731'
     c                   Call      'FA3206'
     c                   PARM                    FecPro            8
      *
     c                   seton                                        lr
