      *
     c                   eval      FicVeh = 'CP01'
      *
     c                   Call      'FA8006'
     c                   Parm                    FicVeh            4
      *
     c                   eval      FicVeh = 'CP02'
     c                   Call      'FA8006'
     c                   Parm                    FicVeh            4
      *
     c                   eval      FicVeh = 'CP03'
     c                   Call      'FA8006'
     c                   Parm                    FicVeh            4
      *
     c                   eval      FicVeh = 'CP04'
     c                   Call      'FA8006'
     c                   Parm                    FicVeh            4
      *
     c                   eval      FicVeh = 'CP06'
     c                   Call      'FA8006'
     c                   Parm                    FicVeh            4
      *
     c                   Seton                                        lr
