 /*=================================================================*/
 /*   NOMBRE DEL PROGRAMA .......: SqlFA01J1                        */
 /*   APLICACION.................: Contabilidad General             */
 /*   AUTOR .....................: Luis J. Miranda V.               */
 /*   FECHA ESCRITURA ...........: 25 / 08 / 2017                   */
 /*                                                                 */
 /*      Proceso Ejecucion Procedimientos Modulo Facturacion        */
 /*=================================================================*/
 INI:        PGM
             COPYRIGHT  TEXT('Miranda Valdez, S. A., 1997')

             DCL        VAR(&CIA) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CTL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&INI) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&RESP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&NCIA)  TYPE(*CHAR) LEN(11)
             DCL        VAR(&NLIB) TYPE(*CHAR) LEN(11) VALUE(FACLIB.V2)
             DCL        VAR(&PRT) TYPE(*CHAR) LEN(10)

             CHGDTAARA  DTAARA(*LDA *ALL) VALUE(' ')

             RTVDTAARA  DTAARA(*LDA (401 2)) RTNVAR(&CIA)
             RTVJOBA    JOB(&WSID) USER(&USER)
             CHGDTAARA  DTAARA(*LDA (551 10)) VALUE(&WSID)
             CHGDTAARA  DTAARA(*LDA (561 10)) VALUE(&USER)
             RTVDTAARA  DTAARA(*LDA (450 10)) RTNVAR(&PRT)

             CALL       PGM(SEGLIB/SEGLIBL)

             IF         COND(&CIA *EQ ' ') THEN(CALL +
                          PGM(*LIBL/SG0000J1))

             CHGDTAARA  DTAARA(*LDA (551 10)) VALUE(&WSID)
             CHGDTAARA  DTAARA(*LDA (561 10)) VALUE(&USER)
             RTVDTAARA  DTAARA(*LDA (400 1)) RTNVAR(&CTL)
             RTVDTAARA  DTAARA(*LDA (401 2)) RTNVAR(&CIA)
             RTVDTAARA  DTAARA(*LDA (450 10)) RTNVAR(&PRT)
             IF         COND(&CTL *EQ ' ') THEN(RETURN)

             RTVDTAARA  DTAARA(*LDA (403 2)) RTNVAR(&INI)
             RTVDTAARA  DTAARA(*LDA (412 11)) RTNVAR(&NCIA)

             CHGVAR     VAR(&PGM) VALUE('FA9999')
             CALL       PGM(SEGLIB/SG2050J1) PARM(&PGM &RESP)

             IF         COND(&RESP *NE ' ') THEN(DO)
             SNDPGMMSG  MSGID(SEG0000) MSGF(SEGLIB/SEGMSGF)
             GOTO       CMDLBL(END)
             ENDDO

             CALL       PGM(SEGLIB/SEGLIBL)

            ADDLIBLE &NCIA
             MONMSG     MSGID(CPF2103)

             CALL       PGM(*LIBL/SQLFA01J2)

END:         ENDPGM
