 /*=================================================================*/
 /*   NOMBRE DEL PROGRAMA .......: SGLIC03J1                        */
 /*   APLICACION.................: Seguridad                        */
 /*   AUTOR .....................: Luis J. Miranda V.               */
 /*   FECHA ESCRITURA ...........: 27 / 01 / 2026                   */
 /*                                                                 */
 /*      Captura Parametros Generador de Licencias                  */
 /*=================================================================*/
 INI:        PGM
             COPYRIGHT  TEXT('Miranda Valdez, S. A., 1997')

             DCL        VAR(&WSID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FECHA) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PGM) TYPE(*CHAR) LEN(10) VALUE('SGLIC04')
             DCL        VAR(&NOMREP) TYPE(*CHAR) LEN(50)
             DCL        VAR(&DATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&SERIE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&MODELO) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PROTYPE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&HOSTN) TYPE(*CHAR) LEN(8)
             DCL        VAR(&FECDIA) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DIAS) TYPE(*CHAR) LEN(9) VALUE('000000000')

             RTVSYSVAL  SYSVAL(QMODEL) RTNVAR(&MODELO)
             RTVSYSVAL  SYSVAL(QSRLNBR) RTNVAR(&SERIE)
             RTVSYSVAL  SYSVAL(QPRCFEAT) RTNVAR(&PROTYPE)
             RTVSYSVAL  SYSVAL(QDATE) RTNVAR(&FECHA)
             RTVNETA    SYSNAME(&HOSTN)

             RTVJOBA    JOB(&WSID) USER(&USER)

             CHGVAR     VAR(&NOMREP) VALUE('Generador de Licencias +
                          Meyker')

             CALL       PGM(*LIBL/SGLIC03) PARM((&NOMREP) (&PGM) +
                          (&SERIE) (&MODELO) (&PROTYPE) (&HOSTN) +
                          (&FECDIA) (&DIAS))

END:         ENDPGM
