     A*%%TS  SD  20260130  081437  MEYKER      REL-V7R4M0  5770-WDS
     A*  92/12/17  11:02:18                REL-R03M00  5728-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R SGLIC0301
     A*%%TS  SD  20260128  060930  MEYKER      REL-V7R4M0  5770-WDS
     A                                      CF03(03 'Salir')
     A                                      CF12(12 'Anterior')
     A                                      CF24(24 'Aplicar')
     A                                      CF04(04 'Lista')
     A                                      RTNCSRLOC(&RECORD &CAMPO)
     A                                      SLNO(01)
     A                                      CLRL(23)
     A                                      OVERLAY
     A                                      PRINT
     A            CAMPO         10A  H
     A            RECORD        10A  H
     A            COLUM          3S 0H
     A            FILA           3S 0H
     A                                  1 52USER
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2  2'Seguridad'
     A                                  2 70TIME
     A            WSID          10A  O  3 70
     A                                 23  6'F3=Salir'
     A                                      COLOR(BLU)
     A                                 23 62'F12=Anterior'
     A                                      COLOR(BLU)
     A                                  6  7'Digite y presione intro.'
     A                                      COLOR(BLU)
     A            TITULO        45A  O  3 18DSPATR(HI)
     A                                  8  2'Fecha Inicio Vigencia. .'
     A            MSGPGM        10A  O  3  2
     A                                  9  2'Fecha Finaliza Vigencia.'
     A                                 10  2'Numero Maximo Usuarios .'
     A            FECINI         8Y 0B  8 27
     A  31                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A            FECFIN         8Y 0B  9 27
     A  32                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTWRD('  /  /    ')
     A                                  8 41'ddmmyyyy'
     A            MAXUSR         5Y 0B 10 27
     A  33                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                  1  2'Miranda Valdez, S. R. L.'
     A                                      DSPATR(HI)
     A          R MSGSFL                    SFL
     A*%%TS  SD  19970623  123943  JTIBURCIO   REL-V3R7M0  5716-PW1
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            @MSGQ                     SFLPGMQ(10)
     A          R MSGCTL                    SFLCTL(MSGSFL)
     A*%%TS  SD  19970623  144713  JTIBURCIO   REL-V3R7M0  5716-PW1
     A                                      HELP
     A                                      OVERLAY
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A  80                                  SFLINZ
     A  80                                  SFLEND
     A                                      SFLSIZ(0005)
     A                                      SFLPAG(0001)
     A            @MSGQ                     SFLPGMQ(10)
